/* Copyright (c) 2009, Code Aurora Forum. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 and
 * only version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA
 * 02110-1301, USA.
 *
 */

#include <linux/delay.h>
#include <linux/types.h>
#include <linux/i2c.h>
#include <linux/uaccess.h>
#include <linux/miscdevice.h>
#include <media/msm_camera.h>
#include <media/msm_camera_sensor.h>
#include <mach/gpio.h>
#include <mach/camera.h>
#include "s5k4e1gx.h"
#include <linux/wakelock.h>
#include <linux/slab.h>
#include <mach/vreg.h>
#include <asm/mach-types.h>

#define S5K4E1GX_REG_MODEL_ID			0x0000
#define S5K4E1GX_MODEL_ID			    0x4E10

#define S5K4E1GX_REVISION_ID			0x0002
#define S5K4E1GX_REVISION_EVT2			    0x00
#define S5K4E1GX_REVISION_EVT3			    0x10

#define S5K4E1GX_REG_MASK_CORRUPTED_FRAME	0x0105
#define S5K4E1GX_MASK_CORRUPTED_FRAME	0x01


static uint8_t sensor_evt_ver = 2;
static struct platform_device *s5k4e1_pdev;

	wake_lock_init(&s5k4e1gx_wake_lock, WAKE_LOCK_IDLE, "s5k4e1gx");
}

static inline void deinit_suspend(void)
{
	wake_lock_destroy(&s5k4e1gx_wake_lock);
}

static inline void prevent_suspend(void)
{
	wake_lock(&s5k4e1gx_wake_lock);
}

static inline void allow_suspend(void)
{
	wake_unlock(&s5k4e1gx_wake_lock);
}

/* PLL Registers */
#define REG_PRE_PLL_CLK_DIV			0x0305
#define REG_PLL_MULTIPLIER_MSB			0x0306
#define REG_PLL_MULTIPLIER_LSB			0x0307
#define REG_VT_SYS_CLK_DIV			0x30B5

/* Output Size */
#define REG_X_OUTPUT_SIZE_MSB			0x034C
#define REG_X_OUTPUT_SIZE_LSB			0x034D
#define REG_Y_OUTPUT_SIZE_MSB			0x034E
#define REG_Y_OUTPUT_SIZE_LSB			0x034F

/* Binning */
#define REG_X_EVEN_INC				0x0381
#define REG_X_ODD_INC				0x0383
#define REG_Y_EVEN_INC				0x0385
#define REG_Y_ODD_INC				0x0387

/* Reserved register */
#define REG_H_BINNING				0x30A9
#define REG_V_BINNING				0x300E

/* Frame Fotmat */
#define REG_FRAME_LENGTH_LINES_MSB		0x0340
#define REG_FRAME_LENGTH_LINES_LSB		0x0341
#define REG_LINE_LENGTH_PCK_MSB			0x0342
#define REG_LINE_LENGTH_PCK_LSB			0x0343

/* Analog Setting Register */
#define REG_CDS_TEST				0x300F
#define REG_RST_OFFSET1				0x3013
#define REG_RMP_INIT				0x3017
#define REG_COMP_BIAS				0x301B

/* Parallel Setting Register */
#define REG_DPHY_BANDCTRL			0x30F1
#define REG_PCLK_INV				0x3110
#define REG_PCLK_DELAY				0x3117
#define REG_V_H_SYNC_STRENGTH			0x3119
#define REG_DATA_PCLK_STRENGTH			0x311A

#define REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB	0x0204
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB	0x0205
#define REG_COARSE_INTEGRATION_TIME_MSB   	0x0202
#define REG_COARSE_INTEGRATION_TIME_LSB   	0x0203

#define REG_FINE_INTEGRATION_TIME_MSB		0x0200
#define REG_FINE_INTEGRATION_TIME_LSB		0x0201
#define REG_COARSE_INTEGRATION_TIME_MSB		0x0202
#define REG_COARSE_INTEGRATION_TIME_LSB		0x0203

/* Mode select register */
#define S5K4E1GX_REG_MODE_SELECT		0x0100
#define S5K4E1GX_MODE_SELECT_STREAM		    0x01	/* start streaming */
#define S5K4E1GX_MODE_SELECT_SW_STANDBY		    0x00	/* software standby */

/* Read Mode */
#define S5K4E1GX_REG_READ_MODE			0x0101
#define S5K4E1GX_READ_NORMAL_MODE		    0x00	/* without mirror/flip */
#define S5K4E1GX_READ_MIRROR_FLIP		    0x03	/* with mirror/flip */

#define S5K4E1GX_REG_SOFTWARE_RESET		0x0103
#define S5K4E1GX_SOFTWARE_RESET			    0x01

#define S5K4E1GX_MIPI_REG_SOFTWARE_RESET		0x3030
#define S5K4E1GX_MIPI_SOFTWARE_RESET			    0x06


#define S5K4E1GX_REG_GROUP_PARAMETER_HOLD	0x0104
#define S5K4E1GX_GROUP_PARAMETER_HOLD		    0x01
#define S5K4E1GX_GROUP_PARAMETER_UNHOLD		    0x00

#define REG_TEST_PATTERN_MODE			0x0601

#define S5K4E1GX_AF_I2C_ADDR			0x18
#define S5K4E1GX_STEPS_NEAR_TO_CLOSEST_INF	36
#define S5K4E1GX_TOTAL_STEPS_NEAR_TO_FAR	36
#define S5K4E1GX_SW_DAMPING_STEP		10
#define S5K4E1GX_MAX_FPS			30

#define S5K4E1GX_MAX_SNAPSHOT_EXP_LC		3961

/* 1126 for MIPI */
#define REG_MIPI_LANE_MODE		0x30E2
#define MHz 1000000
#define MCLK 24

enum s5k4e1gx_reg_update_t{
	REG_INIT,
	REG_PERIODIC
};

struct reg_struct {
    // PLL Setting
	uint8_t pre_pll_clk_div;		/* 0x0305 */
	uint8_t pll_multiplier_msb;		/* 0x0306 */
	uint8_t pll_multiplier_lsb;		/* 0x0307 */
	uint8_t vt_sys_clk_div;			/* 0x30B5 */

	/* Add for MIPI */
	uint8_t MIPI_data_lane_modes;	/* 0x30E2 */

	uint8_t DPHY_bandctrl;			/* 0x30F1 */
    // Read Mode
	uint8_t read_mode;			/* 0x0101 */
    // Output Size Setting
	uint8_t x_output_size_msb;		/* 0x034C */
	uint8_t x_output_size_lsb;		/* 0x034D */
	uint8_t y_output_size_msb;		/* 0x034E */
	uint8_t y_output_size_lsb;		/* 0x034F */
	uint8_t x_even_inc;			/* 0x0381 */
	uint8_t x_odd_inc;			/* 0x0383 */
	uint8_t y_even_inc;			/* 0x0385 */
	uint8_t y_odd_inc;			/* 0x0387 */
	uint8_t h_binning;			/* 0x30A9 */
	uint8_t v_binning;			/* 0x300E */
    // Integration Setting
	uint8_t frame_length_lines_msb;		/* 0x0340 */
	uint8_t frame_length_lines_lsb;		/* 0x0341 */
	uint8_t line_length_pck_msb;		/* 0x0342 */
	uint8_t line_length_pck_lsb;		/* 0x0343 */
    // Parallel Setting
	uint8_t pclk_inv;			/* 0x3110 */
	uint8_t pclk_delay;			/* 0x3117 */
	uint8_t v_h_strength;			/* 0x3119 */
	uint8_t data_pclk_strength;		/* 0x311A */
	// Analog Setting
	uint8_t cds_test;			/* 0x300F */
	uint8_t rst_offset1;			/* 0x3013 */
	uint8_t rmp_init;			/* 0x3017 */
	uint8_t comp_bias;			/* 0x301B */

	uint8_t analogue_gain_code_global_msb;	/* 0x0204 */
	uint8_t analogue_gain_code_global_lsb;	/* 0x0205 */
	uint8_t coarse_integration_time_msb;	/* 0x0202 */
	uint8_t coarse_integration_time_lsb;	/* 0x0203 */
	uint32_t  size_h;
	uint32_t  blk_l;
	uint32_t  size_w;
	uint32_t  blk_p;
};

struct reg_struct s5k4e1gx_reg_cand[2] = {
	{/*Preview, for normal speed*/
		0x06,  /* pre_pll_clk_div               REG=0x0305 */
		0x00,  /* pll_multiplier_msb            REG=0x0306 */
		0x50,  /* pll_multiplier_lsb            REG=0x0307 */
		0x00,  /* vt_sys_clk_div                REG=0x30B5 */

		/* Add for MIPI */
		0x02,  /* MIPI_data_lane_modes          REG=0x30E2 */

		0xB0,  /* DPHY_bandctrl                 REG=0x30F1 */
		0x00,  /* read_mode                     REG=0x0101 */
		0x05,  /* x_output_size_msb             REG=0x034C */
		0x18,  /* x_output_size_lsb             REG=0x034D */
		0x03,  /* y_output_size_msb             REG=0x034E */
		0xD4,  /* y_output_size_lsb             REG=0x034F */
		0x01,  /* x_even_inc                    REG=0x0381 */
		0x01,  /* x_odd_inc                     REG=0x0383 */
